# Accessing data with Pandas

In [22]:
import pandas as pd

### It will for basic python code style

In [24]:
result = pd.read_csv(r"D:\AI ML ENGINEERING JOURNY\02_Python_Foundations\04_Pandas\Advance_Pandas\student_results.csv")

In [37]:
print(result)

   Student_ID   Name  Marks Branch Result
0         101   Amit     78    CSE   Pass
1         102   Riya     85    CSE   Pass
2         103  Sohan     62    ECE   Pass
3         104   Neha     90    CSE   Pass
4         105  Karan     55     ME   Fail

In [25]:
result.head()

   Student_ID   Name  Marks Branch Result
0         101   Amit     78    CSE   Pass
1         102   Riya     85    CSE   Pass
2         103  Sohan     62    ECE   Pass
3         104   Neha     90    CSE   Pass
4         105  Karan     55     ME   Fail

In [29]:
result.head(2)

   Student_ID  Name  Marks Branch Result
0         101  Amit     78    CSE   Pass
1         102  Riya     85    CSE   Pass

In [27]:
result.tail(2)

   Student_ID   Name  Marks Branch Result
3         104   Neha     90    CSE   Pass
4         105  Karan     55     ME   Fail

In [38]:
result.loc[4]

Student_ID      105
Name          Karan
Marks            55
Branch           ME
Result         Fail
Name: 4, dtype: object

In [39]:
result.loc[[1, 3, 4]]

   Student_ID   Name  Marks Branch Result
1         102   Riya     85    CSE   Pass
3         104   Neha     90    CSE   Pass
4         105  Karan     55     ME   Fail

In [40]:
result.loc[2:4]

   Student_ID   Name  Marks Branch Result
2         103  Sohan     62    ECE   Pass
3         104   Neha     90    CSE   Pass
4         105  Karan     55     ME   Fail